---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsCreatedAutomatically
source: html/e9979888-9cdd-7aec-35c0-e2682a315f5d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsCreatedAutomatically Property

[Room] [Room] created automatically.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomsCreatedAutomatically { get; }
```